/*==========================================================================;
 *
 *  Copyright (C) 1994-1997 Microsoft Corporation.  All Rights Reserved.
 *
 *  File:       ddraw.h
 *  Content:    DirectDraw include file
 *
 ***************************************************************************/

#ifndef LDL_DirectX_DirectX7_ddraw_hpp
#define LDL_DirectX_DirectX7_ddraw_hpp

#include <LDL/Config.hpp>

namespace LDL
{
    namespace DirectX7
    {
        #include <LDL/APIs/WinApi/TypesHeader.hpp>

        const DWORD  _FACDD = 0x876;

        inline HRESULT MAKE_DDHRESULT(DWORD code)
        {
            return MAKE_HRESULT(1, _FACDD, code);
        }

        /*
         * FOURCC codes for DX compressed-texture pixel formats
         */
        const DWORD  FOURCC_DXT1 = (MAKEFOURCC('D', 'X', 'T', '1'));
        const DWORD  FOURCC_DXT2 = (MAKEFOURCC('D', 'X', 'T', '2'));
        const DWORD  FOURCC_DXT3 = (MAKEFOURCC('D', 'X', 'T', '3'));
        const DWORD  FOURCC_DXT4 = (MAKEFOURCC('D', 'X', 'T', '4'));
        const DWORD  FOURCC_DXT5 = (MAKEFOURCC('D', 'X', 'T', '5'));

        /*
         * GUIDS used by DirectDraw objects
         */

        const GUID  CLSID_DirectDraw = { 0xD7B70EE0,0x4340,0x11CF,0xB0,0x63,0x00,0x20,0xAF,0xC2,0xCD,0x35 };
        const GUID  CLSID_DirectDraw7 = { 0x3c305196,0x50db,0x11d3,0x9c,0xfe,0x00,0xc0,0x4f,0xd9,0x30,0xc5 };

        typedef struct IDirectDraw7* LPDIRECTDRAW7;
        typedef struct IDirectDrawSurface* LPDIRECTDRAWSURFACE;
        typedef struct IDirectDrawSurface2* LPDIRECTDRAWSURFACE2;
        typedef struct IDirectDrawSurface3* LPDIRECTDRAWSURFACE3;
        typedef struct IDirectDrawSurface4* LPDIRECTDRAWSURFACE4;
        typedef struct IDirectDrawSurface7* LPDIRECTDRAWSURFACE7;

        typedef struct IDirectDrawPalette* LPDIRECTDRAWPALETTE;
        typedef struct IDirectDrawClipper* LPDIRECTDRAWCLIPPER;
        typedef struct IDirectDrawColorControl* LPDIRECTDRAWCOLORCONTROL;
        typedef struct IDirectDrawGammaControl* LPDIRECTDRAWGAMMACONTROL;

        typedef struct _DDFXROP* LPDDFXROP;
        typedef struct _DDSURFACEDESC* LPDDSURFACEDESC;
        typedef struct _DDSURFACEDESC2* LPDDSURFACEDESC2;
        typedef struct _DDCOLORCONTROL* LPDDCOLORCONTROL;

        /*
         * API's
         */
         //extern HRESULT LDL_API_CALL DirectDrawCreate( GUID  *lpGUID, LPDIRECTDRAW  *lplpDD, IUnknown  *pUnkOuter );
         //extern HRESULT LDL_API_CALL DirectDrawCreateEx( GUID  * lpGuid, LPVOID  *lplpDD, const IID &   iid,IUnknown  *pUnkOuter );
         //extern HRESULT LDL_API_CALL DirectDrawCreateClipper( DWORD dwFlags, LPDIRECTDRAWCLIPPER  *lplpDDClipper, IUnknown  *pUnkOuter );

     /*
      * Flags for DirectDrawEnumerateEx
      * DirectDrawEnumerateEx supercedes DirectDrawEnumerate. You must use GetProcAddress to
      * obtain a function pointer (of type LPDIRECTDRAWENUMERATEEX) to DirectDrawEnumerateEx.
      * By default, only the primary display device is enumerated.
      * DirectDrawEnumerate is equivalent to DirectDrawEnumerate(,,DDENUM_NONDISPLAYDEVICES)
      */

      /*
       * This flag causes enumeration of any GDI display devices which are part of
       * the Windows Desktop
       */
        const DWORD  DDENUM_ATTACHEDSECONDARYDEVICES = 0x00000001L;

        /*
         * This flag causes enumeration of any GDI display devices which are not
         * part of the Windows Desktop
         */
        const DWORD  DDENUM_DETACHEDSECONDARYDEVICES = 0x00000002L;

        /*
         * This flag causes enumeration of non-display devices
         */
        const DWORD  DDENUM_NONDISPLAYDEVICES = 0x00000004L;

        const DWORD  DDCREATE_HARDWAREONLY = 0x00000001l;
        const DWORD  DDCREATE_EMULATIONONLY = 0x00000002l;

        //#ifndef WINNT
        typedef HRESULT(LDL_CALL* LPDDENUMMODESCALLBACK)(LPDDSURFACEDESC, LPVOID);
        typedef HRESULT(LDL_CALL* LPDDENUMMODESCALLBACK2)(LPDDSURFACEDESC2, LPVOID);
        typedef HRESULT(LDL_CALL* LPDDENUMSURFACESCALLBACK)(LPDIRECTDRAWSURFACE, LPDDSURFACEDESC, LPVOID);
        typedef HRESULT(LDL_CALL* LPDDENUMSURFACESCALLBACK2)(LPDIRECTDRAWSURFACE4, LPDDSURFACEDESC2, LPVOID);
        typedef HRESULT(LDL_CALL* LPDDENUMSURFACESCALLBACK7)(LPDIRECTDRAWSURFACE7, LPDDSURFACEDESC2, LPVOID);
        //#endif

        /*
         * Generic pixel format with 8-bit RGB and alpha components
         */
        typedef struct _DDARGB
        {
            BYTE blue;
            BYTE green;
            BYTE red;
            BYTE alpha;
        } DDARGB;

        typedef DDARGB* LPDDARGB;

        /*
         * This version of the structure remains for backwards source compatibility.
         * The DDARGB structure is the one that should be used for all DirectDraw APIs.
         */
        typedef struct _DDRGBA
        {
            BYTE red;
            BYTE green;
            BYTE blue;
            BYTE alpha;
        } DDRGBA;

        typedef DDRGBA* LPDDRGBA;


        /*
         * DDCOLORKEY
         */
        typedef struct _DDCOLORKEY
        {
            DWORD       dwColorSpaceLowValue;   // low boundary of color space that is to
            // be treated as Color Key, inclusive
            DWORD       dwColorSpaceHighValue;  // high boundary of color space that is
            // to be treated as Color Key, inclusive
        } DDCOLORKEY;

        typedef DDCOLORKEY* LPDDCOLORKEY;

        /*
         * DDBLTFX
         * Used to pass override information to the DIRECTDRAWSURFACE callback Blt.
         */
        typedef struct _DDBLTFX
        {
            DWORD       dwSize;                         // size of structure
            DWORD       dwDDFX;                         // FX operations
            DWORD       dwROP;                          // Win32 raster operations
            DWORD       dwDDROP;                        // Raster operations new for DirectDraw
            DWORD       dwRotationAngle;                // Rotation angle for blt
            DWORD       dwZBufferOpCode;                // ZBuffer compares
            DWORD       dwZBufferLow;                   // Low limit of Z buffer
            DWORD       dwZBufferHigh;                  // High limit of Z buffer
            DWORD       dwZBufferBaseDest;              // Destination base value
            DWORD       dwZDestConstBitDepth;           // Bit depth used to specify Z constant for destination
            union
            {
                DWORD   dwZDestConst;                   // Constant to use as Z buffer for dest
                LPDIRECTDRAWSURFACE lpDDSZBufferDest;   // Surface to use as Z buffer for dest
            };
            DWORD       dwZSrcConstBitDepth;            // Bit depth used to specify Z constant for source
            union
            {
                DWORD   dwZSrcConst;                    // Constant to use as Z buffer for src
                LPDIRECTDRAWSURFACE lpDDSZBufferSrc;    // Surface to use as Z buffer for src
            };
            DWORD       dwAlphaEdgeBlendBitDepth;       // Bit depth used to specify constant for alpha edge blend
            DWORD       dwAlphaEdgeBlend;               // Alpha for edge blending
            DWORD       dwReserved;
            DWORD       dwAlphaDestConstBitDepth;       // Bit depth used to specify alpha constant for destination
            union
            {
                DWORD   dwAlphaDestConst;               // Constant to use as Alpha Channel
                LPDIRECTDRAWSURFACE lpDDSAlphaDest;     // Surface to use as Alpha Channel
            };
            DWORD       dwAlphaSrcConstBitDepth;        // Bit depth used to specify alpha constant for source
            union
            {
                DWORD   dwAlphaSrcConst;                // Constant to use as Alpha Channel
                LPDIRECTDRAWSURFACE lpDDSAlphaSrc;      // Surface to use as Alpha Channel
            };
            union
            {
                DWORD   dwFillColor;                    // color in RGB or Palettized
                DWORD   dwFillDepth;                    // depth value for z-buffer
                DWORD   dwFillPixel;                    // pixel value for RGBA or RGBZ
                LPDIRECTDRAWSURFACE lpDDSPattern;       // Surface to use as pattern
            };
            DDCOLORKEY  ddckDestColorkey;               // DestColorkey override
            DDCOLORKEY  ddckSrcColorkey;                // SrcColorkey override
        } DDBLTFX;

        typedef DDBLTFX* LPDDBLTFX;



        /*
         * DDSCAPS
         */
        typedef struct _DDSCAPS
        {
            DWORD       dwCaps;         // capabilities of surface wanted
        } DDSCAPS;

        typedef DDSCAPS* LPDDSCAPS;


        /*
         * DDOSCAPS
         */
        typedef struct _DDOSCAPS
        {
            DWORD       dwCaps;         // capabilities of surface wanted
        } DDOSCAPS;

        typedef DDOSCAPS* LPDDOSCAPS;

        /*
         * This structure is used internally by DirectDraw.
         */
        typedef struct _DDSCAPSEX
        {
            DWORD       dwCaps2;
            DWORD       dwCaps3;
            DWORD       dwCaps4;
        } DDSCAPSEX, * LPDDSCAPSEX;

        /*
         * DDSCAPS2
         */
        typedef struct _DDSCAPS2
        {
            DWORD       dwCaps;         // capabilities of surface wanted
            DWORD       dwCaps2;
            DWORD       dwCaps3;
            DWORD       dwCaps4;
        } DDSCAPS2;

        typedef DDSCAPS2* LPDDSCAPS2;

        /*
         * DDCAPS
         */
        const DWORD  DD_ROP_SPACE = (256 / 32);       // space required to store ROP array
        /*
         * NOTE: Our choosen structure number scheme is to append a single digit to
         * the end of the structure giving the version that structure is associated
         * with.
         */

         /*
          * This structure represents the DDCAPS structure released in DirectDraw 1.0.  It is used internally
          * by DirectDraw to interpret caps passed into ddraw by drivers written prior to the release of DirectDraw 2.0.
          * New applications should use the DDCAPS structure defined below.
          */
        typedef struct _DDCAPS_DX1
        {
            DWORD       dwSize;                 // size of the DDDRIVERCAPS structure
            DWORD       dwCaps;                 // driver specific capabilities
            DWORD       dwCaps2;                // more driver specific capabilites
            DWORD       dwCKeyCaps;             // color key capabilities of the surface
            DWORD       dwFXCaps;               // driver specific stretching and effects capabilites
            DWORD       dwFXAlphaCaps;          // alpha driver specific capabilities
            DWORD       dwPalCaps;              // palette capabilities
            DWORD       dwSVCaps;               // stereo vision capabilities
            DWORD       dwAlphaBltConstBitDepths;       // DDBD_2,4,8
            DWORD       dwAlphaBltPixelBitDepths;       // DDBD_1,2,4,8
            DWORD       dwAlphaBltSurfaceBitDepths;     // DDBD_1,2,4,8
            DWORD       dwAlphaOverlayConstBitDepths;   // DDBD_2,4,8
            DWORD       dwAlphaOverlayPixelBitDepths;   // DDBD_1,2,4,8
            DWORD       dwAlphaOverlaySurfaceBitDepths; // DDBD_1,2,4,8
            DWORD       dwZBufferBitDepths;             // DDBD_8,16,24,32
            DWORD       dwVidMemTotal;          // total amount of video memory
            DWORD       dwVidMemFree;           // amount of free video memory
            DWORD       dwMaxVisibleOverlays;   // maximum number of visible overlays
            DWORD       dwCurrVisibleOverlays;  // current number of visible overlays
            DWORD       dwNumFourCCCodes;       // number of four cc codes
            DWORD       dwAlignBoundarySrc;     // source rectangle alignment
            DWORD       dwAlignSizeSrc;         // source rectangle byte size
            DWORD       dwAlignBoundaryDest;    // dest rectangle alignment
            DWORD       dwAlignSizeDest;        // dest rectangle byte size
            DWORD       dwAlignStrideAlign;     // stride alignment
            DWORD       dwRops[DD_ROP_SPACE];   // ROPS supported
            DDSCAPS     ddsCaps;                // DDSCAPS structure has all the general capabilities
            DWORD       dwMinOverlayStretch;    // minimum overlay stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            DWORD       dwMaxOverlayStretch;    // maximum overlay stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            DWORD       dwMinLiveVideoStretch;  // OBSOLETE! This field remains for compatability reasons only
            DWORD       dwMaxLiveVideoStretch;  // OBSOLETE! This field remains for compatability reasons only
            DWORD       dwMinHwCodecStretch;    // OBSOLETE! This field remains for compatability reasons only
            DWORD       dwMaxHwCodecStretch;    // OBSOLETE! This field remains for compatability reasons only
            DWORD       dwReserved1;            // reserved
            DWORD       dwReserved2;            // reserved
            DWORD       dwReserved3;            // reserved
        } DDCAPS_DX1;

        typedef DDCAPS_DX1* LPDDCAPS_DX1;

        /*
         * This structure is the DDCAPS structure as it was in version 2 and 3 of Direct X.
         * It is present for back compatability.
         */
        typedef struct _DDCAPS_DX3
        {
            DWORD       dwSize;                 // size of the DDDRIVERCAPS structure
            DWORD       dwCaps;                 // driver specific capabilities
            DWORD       dwCaps2;                // more driver specific capabilites
            DWORD       dwCKeyCaps;             // color key capabilities of the surface
            DWORD       dwFXCaps;               // driver specific stretching and effects capabilites
            DWORD       dwFXAlphaCaps;          // alpha driver specific capabilities
            DWORD       dwPalCaps;              // palette capabilities
            DWORD       dwSVCaps;               // stereo vision capabilities
            DWORD       dwAlphaBltConstBitDepths;       // DDBD_2,4,8
            DWORD       dwAlphaBltPixelBitDepths;       // DDBD_1,2,4,8
            DWORD       dwAlphaBltSurfaceBitDepths;     // DDBD_1,2,4,8
            DWORD       dwAlphaOverlayConstBitDepths;   // DDBD_2,4,8
            DWORD       dwAlphaOverlayPixelBitDepths;   // DDBD_1,2,4,8
            DWORD       dwAlphaOverlaySurfaceBitDepths; // DDBD_1,2,4,8
            DWORD       dwZBufferBitDepths;             // DDBD_8,16,24,32
            DWORD       dwVidMemTotal;          // total amount of video memory
            DWORD       dwVidMemFree;           // amount of free video memory
            DWORD       dwMaxVisibleOverlays;   // maximum number of visible overlays
            DWORD       dwCurrVisibleOverlays;  // current number of visible overlays
            DWORD       dwNumFourCCCodes;       // number of four cc codes
            DWORD       dwAlignBoundarySrc;     // source rectangle alignment
            DWORD       dwAlignSizeSrc;         // source rectangle byte size
            DWORD       dwAlignBoundaryDest;    // dest rectangle alignment
            DWORD       dwAlignSizeDest;        // dest rectangle byte size
            DWORD       dwAlignStrideAlign;     // stride alignment
            DWORD       dwRops[DD_ROP_SPACE];   // ROPS supported
            DDSCAPS     ddsCaps;                // DDSCAPS structure has all the general capabilities
            DWORD       dwMinOverlayStretch;    // minimum overlay stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            DWORD       dwMaxOverlayStretch;    // maximum overlay stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            DWORD       dwMinLiveVideoStretch;  // minimum live video stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            DWORD       dwMaxLiveVideoStretch;  // maximum live video stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            DWORD       dwMinHwCodecStretch;    // minimum hardware codec stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            DWORD       dwMaxHwCodecStretch;    // maximum hardware codec stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            DWORD       dwReserved1;            // reserved
            DWORD       dwReserved2;            // reserved
            DWORD       dwReserved3;            // reserved
            DWORD       dwSVBCaps;              // driver specific capabilities for System->Vmem blts
            DWORD       dwSVBCKeyCaps;          // driver color key capabilities for System->Vmem blts
            DWORD       dwSVBFXCaps;            // driver FX capabilities for System->Vmem blts
            DWORD       dwSVBRops[DD_ROP_SPACE];// ROPS supported for System->Vmem blts
            DWORD       dwVSBCaps;              // driver specific capabilities for Vmem->System blts
            DWORD       dwVSBCKeyCaps;          // driver color key capabilities for Vmem->System blts
            DWORD       dwVSBFXCaps;            // driver FX capabilities for Vmem->System blts
            DWORD       dwVSBRops[DD_ROP_SPACE];// ROPS supported for Vmem->System blts
            DWORD       dwSSBCaps;              // driver specific capabilities for System->System blts
            DWORD       dwSSBCKeyCaps;          // driver color key capabilities for System->System blts
            DWORD       dwSSBFXCaps;            // driver FX capabilities for System->System blts
            DWORD       dwSSBRops[DD_ROP_SPACE];// ROPS supported for System->System blts
            DWORD       dwReserved4;            // reserved
            DWORD       dwReserved5;            // reserved
            DWORD       dwReserved6;            // reserved
        } DDCAPS_DX3;
        typedef DDCAPS_DX3* LPDDCAPS_DX3;

        /*
         * This structure is the DDCAPS structure as it was in version 5 of Direct X.
         * It is present for back compatability.
         */
        typedef struct _DDCAPS_DX5
        {
            /*  0*/ DWORD   dwSize;                 // size of the DDDRIVERCAPS structure
            /*  4*/ DWORD   dwCaps;                 // driver specific capabilities
            /*  8*/ DWORD   dwCaps2;                // more driver specific capabilites
            /*  c*/ DWORD   dwCKeyCaps;             // color key capabilities of the surface
            /* 10*/ DWORD   dwFXCaps;               // driver specific stretching and effects capabilites
            /* 14*/ DWORD   dwFXAlphaCaps;          // alpha driver specific capabilities
            /* 18*/ DWORD   dwPalCaps;              // palette capabilities
            /* 1c*/ DWORD   dwSVCaps;               // stereo vision capabilities
            /* 20*/ DWORD   dwAlphaBltConstBitDepths;       // DDBD_2,4,8
            /* 24*/ DWORD   dwAlphaBltPixelBitDepths;       // DDBD_1,2,4,8
            /* 28*/ DWORD   dwAlphaBltSurfaceBitDepths;     // DDBD_1,2,4,8
            /* 2c*/ DWORD   dwAlphaOverlayConstBitDepths;   // DDBD_2,4,8
            /* 30*/ DWORD   dwAlphaOverlayPixelBitDepths;   // DDBD_1,2,4,8
            /* 34*/ DWORD   dwAlphaOverlaySurfaceBitDepths; // DDBD_1,2,4,8
            /* 38*/ DWORD   dwZBufferBitDepths;             // DDBD_8,16,24,32
            /* 3c*/ DWORD   dwVidMemTotal;          // total amount of video memory
            /* 40*/ DWORD   dwVidMemFree;           // amount of free video memory
            /* 44*/ DWORD   dwMaxVisibleOverlays;   // maximum number of visible overlays
            /* 48*/ DWORD   dwCurrVisibleOverlays;  // current number of visible overlays
            /* 4c*/ DWORD   dwNumFourCCCodes;       // number of four cc codes
            /* 50*/ DWORD   dwAlignBoundarySrc;     // source rectangle alignment
            /* 54*/ DWORD   dwAlignSizeSrc;         // source rectangle byte size
            /* 58*/ DWORD   dwAlignBoundaryDest;    // dest rectangle alignment
            /* 5c*/ DWORD   dwAlignSizeDest;        // dest rectangle byte size
            /* 60*/ DWORD   dwAlignStrideAlign;     // stride alignment
            /* 64*/ DWORD   dwRops[DD_ROP_SPACE];   // ROPS supported
            /* 84*/ DDSCAPS ddsCaps;                // DDSCAPS structure has all the general capabilities
            /* 88*/ DWORD   dwMinOverlayStretch;    // minimum overlay stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 8c*/ DWORD   dwMaxOverlayStretch;    // maximum overlay stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 90*/ DWORD   dwMinLiveVideoStretch;  // minimum live video stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 94*/ DWORD   dwMaxLiveVideoStretch;  // maximum live video stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 98*/ DWORD   dwMinHwCodecStretch;    // minimum hardware codec stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 9c*/ DWORD   dwMaxHwCodecStretch;    // maximum hardware codec stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* a0*/ DWORD   dwReserved1;            // reserved
            /* a4*/ DWORD   dwReserved2;            // reserved
            /* a8*/ DWORD   dwReserved3;            // reserved
            /* ac*/ DWORD   dwSVBCaps;              // driver specific capabilities for System->Vmem blts
            /* b0*/ DWORD   dwSVBCKeyCaps;          // driver color key capabilities for System->Vmem blts
            /* b4*/ DWORD   dwSVBFXCaps;            // driver FX capabilities for System->Vmem blts
            /* b8*/ DWORD   dwSVBRops[DD_ROP_SPACE];// ROPS supported for System->Vmem blts
            /* d8*/ DWORD   dwVSBCaps;              // driver specific capabilities for Vmem->System blts
            /* dc*/ DWORD   dwVSBCKeyCaps;          // driver color key capabilities for Vmem->System blts
            /* e0*/ DWORD   dwVSBFXCaps;            // driver FX capabilities for Vmem->System blts
            /* e4*/ DWORD   dwVSBRops[DD_ROP_SPACE];// ROPS supported for Vmem->System blts
            /*104*/ DWORD   dwSSBCaps;              // driver specific capabilities for System->System blts
            /*108*/ DWORD   dwSSBCKeyCaps;          // driver color key capabilities for System->System blts
            /*10c*/ DWORD   dwSSBFXCaps;            // driver FX capabilities for System->System blts
            /*110*/ DWORD   dwSSBRops[DD_ROP_SPACE];// ROPS supported for System->System blts
            // Members added for DX5:
            /*130*/ DWORD   dwMaxVideoPorts;        // maximum number of usable video ports
            /*134*/ DWORD   dwCurrVideoPorts;       // current number of video ports used
            /*138*/ DWORD   dwSVBCaps2;             // more driver specific capabilities for System->Vmem blts
            /*13c*/ DWORD   dwNLVBCaps;               // driver specific capabilities for non-local->local vidmem blts
            /*140*/ DWORD   dwNLVBCaps2;              // more driver specific capabilities non-local->local vidmem blts
            /*144*/ DWORD   dwNLVBCKeyCaps;           // driver color key capabilities for non-local->local vidmem blts
            /*148*/ DWORD   dwNLVBFXCaps;             // driver FX capabilities for non-local->local blts
            /*14c*/ DWORD   dwNLVBRops[DD_ROP_SPACE]; // ROPS supported for non-local->local blts
        } DDCAPS_DX5;
        typedef DDCAPS_DX5* LPDDCAPS_DX5;

        typedef struct _DDCAPS_DX6
        {
            /*  0*/ DWORD   dwSize;                 // size of the DDDRIVERCAPS structure
            /*  4*/ DWORD   dwCaps;                 // driver specific capabilities
            /*  8*/ DWORD   dwCaps2;                // more driver specific capabilites
            /*  c*/ DWORD   dwCKeyCaps;             // color key capabilities of the surface
            /* 10*/ DWORD   dwFXCaps;               // driver specific stretching and effects capabilites
            /* 14*/ DWORD   dwFXAlphaCaps;          // alpha caps
            /* 18*/ DWORD   dwPalCaps;              // palette capabilities
            /* 1c*/ DWORD   dwSVCaps;               // stereo vision capabilities
            /* 20*/ DWORD   dwAlphaBltConstBitDepths;       // DDBD_2,4,8
            /* 24*/ DWORD   dwAlphaBltPixelBitDepths;       // DDBD_1,2,4,8
            /* 28*/ DWORD   dwAlphaBltSurfaceBitDepths;     // DDBD_1,2,4,8
            /* 2c*/ DWORD   dwAlphaOverlayConstBitDepths;   // DDBD_2,4,8
            /* 30*/ DWORD   dwAlphaOverlayPixelBitDepths;   // DDBD_1,2,4,8
            /* 34*/ DWORD   dwAlphaOverlaySurfaceBitDepths; // DDBD_1,2,4,8
            /* 38*/ DWORD   dwZBufferBitDepths;             // DDBD_8,16,24,32
            /* 3c*/ DWORD   dwVidMemTotal;          // total amount of video memory
            /* 40*/ DWORD   dwVidMemFree;           // amount of free video memory
            /* 44*/ DWORD   dwMaxVisibleOverlays;   // maximum number of visible overlays
            /* 48*/ DWORD   dwCurrVisibleOverlays;  // current number of visible overlays
            /* 4c*/ DWORD   dwNumFourCCCodes;       // number of four cc codes
            /* 50*/ DWORD   dwAlignBoundarySrc;     // source rectangle alignment
            /* 54*/ DWORD   dwAlignSizeSrc;         // source rectangle byte size
            /* 58*/ DWORD   dwAlignBoundaryDest;    // dest rectangle alignment
            /* 5c*/ DWORD   dwAlignSizeDest;        // dest rectangle byte size
            /* 60*/ DWORD   dwAlignStrideAlign;     // stride alignment
            /* 64*/ DWORD   dwRops[DD_ROP_SPACE];   // ROPS supported
            /* 84*/ DDSCAPS ddsOldCaps;             // Was DDSCAPS  ddsCaps. ddsCaps is of type DDSCAPS2 for DX6
            /* 88*/ DWORD   dwMinOverlayStretch;    // minimum overlay stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 8c*/ DWORD   dwMaxOverlayStretch;    // maximum overlay stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 90*/ DWORD   dwMinLiveVideoStretch;  // minimum live video stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 94*/ DWORD   dwMaxLiveVideoStretch;  // maximum live video stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 98*/ DWORD   dwMinHwCodecStretch;    // minimum hardware codec stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 9c*/ DWORD   dwMaxHwCodecStretch;    // maximum hardware codec stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* a0*/ DWORD   dwReserved1;            // reserved
            /* a4*/ DWORD   dwReserved2;            // reserved
            /* a8*/ DWORD   dwReserved3;            // reserved
            /* ac*/ DWORD   dwSVBCaps;              // driver specific capabilities for System->Vmem blts
            /* b0*/ DWORD   dwSVBCKeyCaps;          // driver color key capabilities for System->Vmem blts
            /* b4*/ DWORD   dwSVBFXCaps;            // driver FX capabilities for System->Vmem blts
            /* b8*/ DWORD   dwSVBRops[DD_ROP_SPACE];// ROPS supported for System->Vmem blts
            /* d8*/ DWORD   dwVSBCaps;              // driver specific capabilities for Vmem->System blts
            /* dc*/ DWORD   dwVSBCKeyCaps;          // driver color key capabilities for Vmem->System blts
            /* e0*/ DWORD   dwVSBFXCaps;            // driver FX capabilities for Vmem->System blts
            /* e4*/ DWORD   dwVSBRops[DD_ROP_SPACE];// ROPS supported for Vmem->System blts
            /*104*/ DWORD   dwSSBCaps;              // driver specific capabilities for System->System blts
            /*108*/ DWORD   dwSSBCKeyCaps;          // driver color key capabilities for System->System blts
            /*10c*/ DWORD   dwSSBFXCaps;            // driver FX capabilities for System->System blts
            /*110*/ DWORD   dwSSBRops[DD_ROP_SPACE];// ROPS supported for System->System blts
            /*130*/ DWORD   dwMaxVideoPorts;        // maximum number of usable video ports
            /*134*/ DWORD   dwCurrVideoPorts;       // current number of video ports used
            /*138*/ DWORD   dwSVBCaps2;             // more driver specific capabilities for System->Vmem blts
            /*13c*/ DWORD   dwNLVBCaps;               // driver specific capabilities for non-local->local vidmem blts
            /*140*/ DWORD   dwNLVBCaps2;              // more driver specific capabilities non-local->local vidmem blts
            /*144*/ DWORD   dwNLVBCKeyCaps;           // driver color key capabilities for non-local->local vidmem blts
            /*148*/ DWORD   dwNLVBFXCaps;             // driver FX capabilities for non-local->local blts
            /*14c*/ DWORD   dwNLVBRops[DD_ROP_SPACE]; // ROPS supported for non-local->local blts
            // Members added for DX6 release
            /*16c*/ DDSCAPS2 ddsCaps;               // Surface Caps
        } DDCAPS_DX6;
        typedef DDCAPS_DX6* LPDDCAPS_DX6;

        typedef struct _DDCAPS_DX7
        {
            /*  0*/ DWORD   dwSize;                 // size of the DDDRIVERCAPS structure
            /*  4*/ DWORD   dwCaps;                 // driver specific capabilities
            /*  8*/ DWORD   dwCaps2;                // more driver specific capabilites
            /*  c*/ DWORD   dwCKeyCaps;             // color key capabilities of the surface
            /* 10*/ DWORD   dwFXCaps;               // driver specific stretching and effects capabilites
            /* 14*/ DWORD   dwFXAlphaCaps;          // alpha driver specific capabilities
            /* 18*/ DWORD   dwPalCaps;              // palette capabilities
            /* 1c*/ DWORD   dwSVCaps;               // stereo vision capabilities
            /* 20*/ DWORD   dwAlphaBltConstBitDepths;       // DDBD_2,4,8
            /* 24*/ DWORD   dwAlphaBltPixelBitDepths;       // DDBD_1,2,4,8
            /* 28*/ DWORD   dwAlphaBltSurfaceBitDepths;     // DDBD_1,2,4,8
            /* 2c*/ DWORD   dwAlphaOverlayConstBitDepths;   // DDBD_2,4,8
            /* 30*/ DWORD   dwAlphaOverlayPixelBitDepths;   // DDBD_1,2,4,8
            /* 34*/ DWORD   dwAlphaOverlaySurfaceBitDepths; // DDBD_1,2,4,8
            /* 38*/ DWORD   dwZBufferBitDepths;             // DDBD_8,16,24,32
            /* 3c*/ DWORD   dwVidMemTotal;          // total amount of video memory
            /* 40*/ DWORD   dwVidMemFree;           // amount of free video memory
            /* 44*/ DWORD   dwMaxVisibleOverlays;   // maximum number of visible overlays
            /* 48*/ DWORD   dwCurrVisibleOverlays;  // current number of visible overlays
            /* 4c*/ DWORD   dwNumFourCCCodes;       // number of four cc codes
            /* 50*/ DWORD   dwAlignBoundarySrc;     // source rectangle alignment
            /* 54*/ DWORD   dwAlignSizeSrc;         // source rectangle byte size
            /* 58*/ DWORD   dwAlignBoundaryDest;    // dest rectangle alignment
            /* 5c*/ DWORD   dwAlignSizeDest;        // dest rectangle byte size
            /* 60*/ DWORD   dwAlignStrideAlign;     // stride alignment
            /* 64*/ DWORD   dwRops[DD_ROP_SPACE];   // ROPS supported
            /* 84*/ DDSCAPS ddsOldCaps;             // Was DDSCAPS  ddsCaps. ddsCaps is of type DDSCAPS2 for DX6
            /* 88*/ DWORD   dwMinOverlayStretch;    // minimum overlay stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 8c*/ DWORD   dwMaxOverlayStretch;    // maximum overlay stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 90*/ DWORD   dwMinLiveVideoStretch;  // minimum live video stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 94*/ DWORD   dwMaxLiveVideoStretch;  // maximum live video stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 98*/ DWORD   dwMinHwCodecStretch;    // minimum hardware codec stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* 9c*/ DWORD   dwMaxHwCodecStretch;    // maximum hardware codec stretch factor multiplied by 1000, eg 1000 == 1.0, 1300 == 1.3
            /* a0*/ DWORD   dwReserved1;            // reserved
            /* a4*/ DWORD   dwReserved2;            // reserved
            /* a8*/ DWORD   dwReserved3;            // reserved
            /* ac*/ DWORD   dwSVBCaps;              // driver specific capabilities for System->Vmem blts
            /* b0*/ DWORD   dwSVBCKeyCaps;          // driver color key capabilities for System->Vmem blts
            /* b4*/ DWORD   dwSVBFXCaps;            // driver FX capabilities for System->Vmem blts
            /* b8*/ DWORD   dwSVBRops[DD_ROP_SPACE];// ROPS supported for System->Vmem blts
            /* d8*/ DWORD   dwVSBCaps;              // driver specific capabilities for Vmem->System blts
            /* dc*/ DWORD   dwVSBCKeyCaps;          // driver color key capabilities for Vmem->System blts
            /* e0*/ DWORD   dwVSBFXCaps;            // driver FX capabilities for Vmem->System blts
            /* e4*/ DWORD   dwVSBRops[DD_ROP_SPACE];// ROPS supported for Vmem->System blts
            /*104*/ DWORD   dwSSBCaps;              // driver specific capabilities for System->System blts
            /*108*/ DWORD   dwSSBCKeyCaps;          // driver color key capabilities for System->System blts
            /*10c*/ DWORD   dwSSBFXCaps;            // driver FX capabilities for System->System blts
            /*110*/ DWORD   dwSSBRops[DD_ROP_SPACE];// ROPS supported for System->System blts
            /*130*/ DWORD   dwMaxVideoPorts;        // maximum number of usable video ports
            /*134*/ DWORD   dwCurrVideoPorts;       // current number of video ports used
            /*138*/ DWORD   dwSVBCaps2;             // more driver specific capabilities for System->Vmem blts
            /*13c*/ DWORD   dwNLVBCaps;               // driver specific capabilities for non-local->local vidmem blts
            /*140*/ DWORD   dwNLVBCaps2;              // more driver specific capabilities non-local->local vidmem blts
            /*144*/ DWORD   dwNLVBCKeyCaps;           // driver color key capabilities for non-local->local vidmem blts
            /*148*/ DWORD   dwNLVBFXCaps;             // driver FX capabilities for non-local->local blts
            /*14c*/ DWORD   dwNLVBRops[DD_ROP_SPACE]; // ROPS supported for non-local->local blts
            // Members added for DX6 release
            /*16c*/ DDSCAPS2 ddsCaps;               // Surface Caps
        } DDCAPS_DX7;
        typedef DDCAPS_DX7* LPDDCAPS_DX7;

        typedef DDCAPS_DX7 DDCAPS;

        typedef DDCAPS* LPDDCAPS;


        /*
         * DDPIXELFORMAT
         */
        typedef struct _DDPIXELFORMAT
        {
            DWORD       dwSize;                 // size of structure
            DWORD       dwFlags;                // pixel format flags
            DWORD       dwFourCC;               // (FOURCC code)
            union
            {
                DWORD   dwRGBBitCount;          // how many bits per pixel
                DWORD   dwYUVBitCount;          // how many bits per pixel
                DWORD   dwZBufferBitDepth;      // how many total bits/pixel in z buffer (including any stencil bits)
                DWORD   dwAlphaBitDepth;        // how many bits for alpha channels
                DWORD   dwLuminanceBitCount;    // how many bits per pixel
